package timmax.tilegame.basemodel.placement.gamemove;

//  Ход должен соответствовать правилам типа игры без относительно расстановки.
//      Например, для Сокобан:
//          - нельзя переместить игрока более чем на одну плитку по горизонтали или вертикали.
//      Например, для Шахмат:
//          - нельзя переместить слона как коня.
//  Конструктор хода может быть выполнен без исключений, если ход (как будто доска пустая) соответствует правилам.

//  Игровой ход (только одного игрока в игровом цикле).
public abstract class GameMove {
}
